_Rarzrabotki/Rarus/USO2/Enums/уатСистемаGPS.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>уатСистемаGPS</Name>
			<Comment>Cистема мониторинга (уат)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>_1СЦСМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Dynafleet</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Omnicomm</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Wialon</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвтоГРАФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Автотрекер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКАУТ</Name>
					<Comment>СКАУТ</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/CommonForms/уатФормаСинхронизацииТСмеждуУАТиМониторингом/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем мсвСопоставленныеТС;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Автотест = Истина;
		Возврат;
	КонецЕсли;
	
	уатИспользоватьOmnicomm = Константы.уатИспользоватьOmnicomm.Получить();
	уатИспользоватьWialon   = Константы.уатИспользоватьWialon.Получить();
	уатИспользоватьСКАУТ    = Константы.уатИспользоватьСКАУТ.Получить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВосстановитьНастройки();
	ОбновитьСписокВыбораИспользуемойСистемыМониторинга();
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокТС, "ТекСистемаGPS", СистемаGPS);
	
	мсвСопоставленныеТС = Новый Массив();
	Элементы.ОтображатьСопоставленные.Пометка = ОтображатьСопоставленные;
	ЗапонитьСписокGPSСервер(мсвСопоставленныеТС);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаСервереБезКонтекста
Процедура СписокТСПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Если Настройки.ДополнительныеСвойства.Свойство("мсвСопоставленныеТС") Тогда
		мсвСопоставленныеТС = Настройки.ДополнительныеСвойства.мсвСопоставленныеТС;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(мсвСопоставленныеТС) Тогда
		мсвСопоставленныеТС = Новый Массив();
	КонецЕсли;
	
	Если Настройки.ДополнительныеСвойства.Свойство("СписокGPS") Тогда
		Для Каждого ТекТс Из Настройки.ДополнительныеСвойства.СписокGPS Цикл
			ТекТс.ТССопоставлена = Ложь;
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого Строка Из Строки Цикл
		ДанныеСтроки = Строка.Значение.Данные;
		Для Каждого ТекСтрока Из мсвСопоставленныеТС Цикл
			Если ТекСтрока.ТекТС <> ДанныеСтроки.Ссылка Тогда
				Продолжить;
			КонецЕсли;
			ДанныеСтроки.ИДвСистемеНавигации = ТекСтрока.ИДвСистемеНавигации;
			ДанныеСтроки.СистемаGPS          = ТекСтрока.СистемаGPS;
		КонецЦикла;
		Если НЕ ЗначениеЗаполнено(ДанныеСтроки.ИДвСистемеНавигации) Тогда
			ДанныеСтроки.ИДвСистемеНавигации = ДанныеСтроки.Ссылка.уатИДвСистемеНавигации;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ДанныеСтроки.СистемаGPS) Тогда
			ДанныеСтроки.СистемаGPS = ДанныеСтроки.Ссылка.уатИспользуемаяСистемаGPS;
		КонецЕсли;
		Если Настройки.ДополнительныеСвойства.Свойство("СписокGPS") Тогда
			мСписокGPS = Настройки.ДополнительныеСвойства.СписокGPS.НайтиСтроки(Новый Структура("ИДвСистемеНавигации", ДанныеСтроки.ИДвСистемеНавигации));
			Если мСписокGPS.Количество() > 0 Тогда
				мСписокGPS[0].ТССопоставлена = Истина;
				ДанныеСтроки.НаименованиеВСистемеМонитринга = мСписокGPS[0].Наименование;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СистемаGPSПриИзменении(Элемент)
	Если СистемаGPS = ПредопределенноеЗначение("Перечисление.уатСистемаGPS.Omnicomm") Тогда
		УчетнаяЗапись = Omnicomm_УчетнаяЗапись;
	ИначеЕсли СистемаGPS = ПредопределенноеЗначение("Перечисление.уатСистемаGPS.СКАУТ") Тогда
		УчетнаяЗапись = СКАУТ_УчетнаяЗапись;
	ИначеЕсли СистемаGPS = ПредопределенноеЗначение("Перечисление.уатСистемаGPS.Wialon") Тогда
		УчетнаяЗапись = Wialon_УчетнаяЗапись;
	ИначеЕсли ЗначениеЗаполнено(СистемаGPS) Тогда
		УчетнаяЗапись = ПСМ_УчетнаяЗапись;
	КонецЕсли;
	
	ЗапонитьСписокGPSСервер(мсвСопоставленныеТС);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокТС, "ТекСистемаGPS", СистемаGPS);
	СохранитьНастройки();
КонецПроцедуры

&НаКлиенте
Процедура УчетнаяЗаписьПриИзменении(Элемент)
	ЗапонитьСписокGPSСервер(мсвСопоставленныеТС);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокТС, "ТекСистемаGPS", СистемаGPS);
	СохранитьНастройки();
КонецПроцедуры

&НаКлиенте
Процедура СписокGPSНачалоПеретаскивания(Элемент, ПараметрыПеретаскивания, Выполнение)
	
	СтандартнаяОбработка = Ложь;
	ТекДанные = Элементы.СписокGPS.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокТСПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура СписокТСПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	ТекДанные = Элементы.СписокGPS.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		ТекстНСТР = НСтр("en='Not selected element to drag';ru='Не выбран элемент для перетаскивания'");
		ПоказатьПредупреждение(Неопределено, ТекстНСТР,,"Ошибка");
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(Строка) <> Тип("СправочникСсылка.ТранспортныеСредства") Тогда
		Возврат;
	КонецЕсли;
	
	ИДвСистемеНавигации = ТекДанные.ИДвСистемеНавигации;
	СопоставитьТС(Строка, ИДвСистемеНавигации);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗапонитьСписокGPS(Команда)
	
	ЗапонитьСписокGPSСервер(мсвСопоставленныеТС);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьСопоставленные(Команда)
	Элементы.ОтображатьСопоставленные.Пометка = НЕ Элементы.ОтображатьСопоставленные.Пометка;
	ОтображатьСопоставленные = Элементы.ОтображатьСопоставленные.Пометка;
	СохранитьНастройки();
КонецПроцедуры

&НаКлиенте
Процедура Сопоставить(Команда)
	
	ТекущиеДанныеGPS = Элементы.СписокGPS.ТекущиеДанные;
	Если ТекущиеДанныеGPS = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекТС = Элементы.СписокТС.ТекущиеДанные;
	Если ТекТС = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекТС = ТекТС.Ссылка;
	ИДвСистемеНавигации = ТекущиеДанныеGPS.ИДвСистемеНавигации;
	СопоставитьТС(ТекТС, ИДвСистемеНавигации);
	
КонецПроцедуры

&НаКлиенте
Процедура СопоставитьВсе(Команда)
	
	мсвСопоставленныеТС.Очистить();
	флагТСНайдены = Ложь;
	Для Каждого ТекСтрока Из СписокGPS Цикл
		Если ТекСтрока.ТССопоставлена Тогда
			Продолжить;
		КонецЕсли;
		ТекТС = ПолучитьСопоставленнуюТССервер(ТекСтрока.ГаражныйНомер, ТекСтрока.Наименование);
		Если ЗначениеЗаполнено(ТекТС) Тогда
			ИДвСистемеНавигации = ТекСтрока.ИДвСистемеНавигации;
			мсвСопоставленныеТС.Добавить(Новый Структура("ТекТС, ИДвСистемеНавигации, СистемаGPS", ТекТС, ИДвСистемеНавигации, СистемаGPS));
			флагТСНайдены = Истина;
		КонецЕсли;
	КонецЦикла;
	Если флагТСНайдены Тогда
		СопоставитьСервер(мсвСопоставленныеТС);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	Если мсвСопоставленныеТС <> Неопределено 
		И ТипЗнч(мсвСопоставленныеТС) = Тип("Массив") 
		И мсвСопоставленныеТС.Количество()>0 Тогда
		Для Каждого ТекСтрока Из мсвСопоставленныеТС Цикл
			ЗаписатьСервер(ТекСтрока.ТекТС, ТекСтрока.ИДвСистемеНавигации, ТекСтрока.СистемаGPS);
		КонецЦикла;
		ПоказатьПредупреждение(, "Изменения записаны успешно!");
	Иначе
		ПоказатьПредупреждение(, "Не выбраны данные для сопоставления!");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СопоставитьСервер(мсвСопоставленныеТС)
	СписокТС.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("СписокGPS", СписокGPS);
	СписокТС.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("мсвСопоставленныеТС", мсвСопоставленныеТС);
	Элементы.СписокТС.Обновить();
	Элементы.СписокGPS.Обновить();
КонецПроцедуры

&НаСервере
Функция ПолучитьСопоставленнуюТССервер(ГаражныйНомер, Наименование)
	ТекТС  = Неопределено;
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	уатТС.Ссылка КАК Ссылка,
	               |	0 КАК Приоритет
	               |ИЗ
	               |	Справочник.ТранспортныеСредства КАК уатТС
	               |ГДЕ
	               |	уатТС.уатГаражныйНомер = &ГаражныйНомер
	               |	И уатТС.уатИДвСистемеНавигации = """"
	               |	И &ГаражныйНомер <> """"
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	уатТС.Ссылка,
	               |	1
	               |ИЗ
	               |	Справочник.ТранспортныеСредства КАК уатТС
	               |ГДЕ
	               |	уатТС.Наименование = &Наименование
	               |	И уатТС.уатИДвСистемеНавигации = """"
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Приоритет";
	Запрос.УстановитьПараметр("ГаражныйНомер", ГаражныйНомер);
	Запрос.УстановитьПараметр("Наименование", Наименование);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ТекТС = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат ТекТС;
	
КонецФункции

&НаСервере
Процедура ЗаписатьСервер(ТекТС, ИДвСистемеНавигации, СистемаGPS)
	
	Объект = ТекТС.Ссылка.ПолучитьОбъект();
	Объект.уатИспользуемаяСистемаGPS       = СистемаGPS;
	Объект.уатУчетнаяЗаписьСистемыМониторинга = УчетнаяЗапись;
	Объект.уатИДвСистемеНавигации          = ИДвСистемеНавигации;
	Объект.Записать();
	
КонецПроцедуры

&НаСервере
Процедура ЗапонитьСписокGPSСервер(мсвСопоставленныеТС)
	
	Если ЗначениеЗаполнено(СистемаGPS) Тогда
		Элементы.СписокGPSНаименование.Заголовок = Нстр("en = 'Name'; ru = 'Наименование'") + " (" + СистемаGPS +")";
		Элементы.СписокGPSИДвСистемеНавигации.Заголовок = Нстр("en = 'ID'; ru = 'ID'") + " (" + СистемаGPS +")";
		Элементы.СписокGPSГаражныйНомер.Заголовок = Нстр("en = 'Garage number'; ru = 'Гаражный номер'") + " (" + СистемаGPS +")";
	КонецЕсли;
	
	СписокGPS.Очистить();
	ТабДанных  = Неопределено;
	ТекстОшибки = "";
	Если СистемаGPS = ПредопределенноеЗначение("Перечисление.уатСистемаGPS.Omnicomm") Тогда
		КодВозврата = уатЗащищенныеФункцииСервер_проф.Omnicomm_ПолучитьДанныеВсехТС(ТабДанных, ТекстОшибки, УчетнаяЗапись);
		Если КодВозврата = 0 И ТекстОшибки = "" Тогда
			Для Каждого ТекТС Из ТабДанных Цикл
				НоваяСтрока = СписокGPS.Добавить();
				НоваяСтрока.Наименование        = ТекТС.nm;
				НоваяСтрока.ИДвСистемеНавигации = ТекТС.id;
				НоваяСтрока.ГаражныйНомер       = ТекТС.garageNumber;
			КонецЦикла;
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		КонецЕсли;
	ИначеЕсли СистемаGPS = ПредопределенноеЗначение("Перечисление.уатСистемаGPS.Wialon") Тогда
		КодВозврата = уатЗащищенныеФункцииСервер_проф.Wialon_ПолучитьДанныеВсехТС(ТабДанных, ТекстОшибки,, УчетнаяЗапись);
		Если КодВозврата = 0 И ТекстОшибки = "" Тогда
			Для Каждого ТекТС Из ТабДанных Цикл
				НоваяСтрока = СписокGPS.Добавить();
				НоваяСтрока.Наименование        = ТекТС.nm;
				НоваяСтрока.ИДвСистемеНавигации = ТекТС.id;
			КонецЦикла;
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		КонецЕсли;
	ИначеЕсли СистемаGPS = ПредопределенноеЗначение("Перечисление.уатСистемаGPS.СКАУТ") Тогда
		КодВозврата = уатЗащищенныеФункцииСервер_проф.ПолучитьОписаниеТССКАУТЧерезВебСервис(ТабДанных, ТекстОшибки, УчетнаяЗапись);
		Если КодВозврата = 0 И ТекстОшибки = "" Тогда
			Для Каждого ТекТС Из ТабДанных Цикл
				НоваяСтрока = СписокGPS.Добавить();
				НоваяСтрока.Наименование        = ТекТС.Name;
				НоваяСтрока.ИДвСистемеНавигации = ТекТС.UnitId;
				НоваяСтрока.ГаражныйНомер       = ТекТС.garageNumber;
			КонецЦикла;
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		КонецЕсли;
	Иначе
		ИдентификаторДействия = "ОбщаяФорма.уатФормаСинхронизацииТСмеждуУАТиМониторингом.ЗапонитьСписокGPSСервер";
		уатРаботаСРасширениями.ПСМ_ВыполнитьДействияВФорме(ИдентификаторДействия, СистемаGPS, УчетнаяЗапись, ЭтотОбъект, СписокGPS);
	КонецЕсли;
	
	СписокGPS.Сортировать("Наименование");
	СписокТС.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("СписокGPS", СписокGPS);
	СписокТС.КомпоновщикНастроек.Настройки.ДополнительныеСвойства.Вставить("мсвСопоставленныеТС", мсвСопоставленныеТС);
	Элементы.СписокТС.Обновить();
	Элементы.СписокGPS.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокВыбораИспользуемойСистемыМониторинга()
	Элементы.СистемаGPS.СписокВыбора.Очистить();
	Если уатИспользоватьOmnicomm Тогда
		Элементы.СистемаGPS.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.уатСистемаGPS.Omnicomm"));
	КонецЕсли;
	Если уатИспользоватьWialon Тогда
		Элементы.СистемаGPS.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.уатСистемаGPS.Wialon"));
	КонецЕсли;
	Если уатИспользоватьСКАУТ Тогда
		Элементы.СистемаGPS.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.уатСистемаGPS.СКАУТ"));
	КонецЕсли;
	
	МассивПСМ = Новый Массив();
	уатРаботаСРасширениями.ПСМ_ЗаполнитьМассивПСМ(МассивПСМ);
	Для Каждого ТекСтрока Из МассивПСМ Цикл
		Элементы.СистемаGPS.СписокВыбора.Добавить(ТекСтрока);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ВосстановитьНастройки()
	
	УстановитьПривилегированныйРежим(Истина);
	СтруктураНастроек = ХранилищеНастроекДанныхФорм.Загрузить(
		"ОбщаяФорма.уатФормаСинхронизацииТСмеждуУАТиМониторингом", 
		"уатФормаСинхронизацииТСмеждуУАТиМониторингом");
	
	Если ТипЗнч(СтруктураНастроек) <> Тип("Структура") Тогда
		СтруктураНастроек = Новый Структура("СистемаGPS, ОтображатьСопоставленные, УчетнаяЗапись");
		Если уатИспользоватьOmnicomm Тогда
			СтруктураНастроек.СистемаGPS = Перечисления.уатСистемаGPS.Omnicomm;
		ИначеЕсли уатИспользоватьWialon Тогда
			СтруктураНастроек.СистемаGPS = Перечисления.уатСистемаGPS.Wialon;
		ИначеЕсли уатИспользоватьСКАУТ Тогда
			СтруктураНастроек.СистемаGPS = Перечисления.уатСистемаGPS.СКАУТ;
		Иначе
			МассивПСМ = Новый Массив();
			уатРаботаСРасширениями.ПСМ_ЗаполнитьМассивПСМ(МассивПСМ);
			Если МассивПСМ.Количество() > 0 Тогда
				СтруктураНастроек.СистемаGPS = МассивПСМ[0];
			КонецЕсли;
		КонецЕсли;
		СтруктураНастроек.ОтображатьСопоставленные = Истина;
	КонецЕсли;
	
	СтруктураНастроек.Свойство("СистемаGPS", СистемаGPS);
	СтруктураНастроек.Свойство("ОтображатьСопоставленные", ОтображатьСопоставленные);
	
	Если СистемаGPS = Перечисления.уатСистемаGPS.Omnicomm Тогда
		Если НЕ уатИспользоватьOmnicomm Тогда
			СистемаGPS = Перечисления.уатСистемаGPS.ПустаяСсылка();
		КонецЕсли;
	ИначеЕсли СистемаGPS = Перечисления.уатСистемаGPS.Wialon Тогда
		Если НЕ уатИспользоватьWialon Тогда
			СистемаGPS = Перечисления.уатСистемаGPS.ПустаяСсылка();
		КонецЕсли;
	ИначеЕсли СистемаGPS = Перечисления.уатСистемаGPS.СКАУТ Тогда
		Если НЕ уатИспользоватьСКАУТ Тогда
			СистемаGPS = Перечисления.уатСистемаGPS.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	
	СтруктураНастроек.Свойство("УчетнаяЗапись",  УчетнаяЗапись);
	
	СтруктураНастроек = ХранилищеНастроекДанныхФорм.Загрузить(
	"ОбщаяФорма.уатНастройкиМониторинга", 
	"УчетнаяЗапись"
	); 
	
	Если ТипЗнч(СтруктураНастроек) <> Тип("Структура") Тогда
		СтруктураНастроек = Новый Структура();
		СтруктураНастроек.Вставить("ПСМ_УчетнаяЗапись",			Справочники.уатУчетныеЗаписиСистемыМониторинга.ПСМ);
		СтруктураНастроек.Вставить("Omnicomm_УчетнаяЗапись",	Справочники.уатУчетныеЗаписиСистемыМониторинга.Omnicomm);
		СтруктураНастроек.Вставить("Dynafleet_УчетнаяЗапись",	Справочники.уатУчетныеЗаписиСистемыМониторинга.Dynafleet);
		СтруктураНастроек.Вставить("СКАУТ_УчетнаяЗапись",		Справочники.уатУчетныеЗаписиСистемыМониторинга.СКАУТ);
		СтруктураНастроек.Вставить("АвтоГРАФ_УчетнаяЗапись",	Справочники.уатУчетныеЗаписиСистемыМониторинга.АвтоГРАФ);
		СтруктураНастроек.Вставить("Wialon_УчетнаяЗапись",		Справочники.уатУчетныеЗаписиСистемыМониторинга.Wialon);
	Иначе
		СтруктураНастроек.Вставить("ПСМ_УчетнаяЗапись",				 Справочники.уатУчетныеЗаписиСистемыМониторинга.ПСМ);
	КонецЕсли;
	
	СтруктураНастроек.Свойство("Omnicomm_УчетнаяЗапись",	 Omnicomm_УчетнаяЗапись);
	СтруктураНастроек.Свойство("СКАУТ_УчетнаяЗапись",		 СКАУТ_УчетнаяЗапись);
	СтруктураНастроек.Свойство("Wialon_УчетнаяЗапись",		 Wialon_УчетнаяЗапись);
	СтруктураНастроек.Свойство("ПСМ_УчетнаяЗапись",			 ПСМ_УчетнаяЗапись);
	
	Если НЕ ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		Если СистемаGPS = Перечисления.уатСистемаGPS.Omnicomm Тогда
			УчетнаяЗапись = Omnicomm_УчетнаяЗапись;
		ИначеЕсли СистемаGPS = Перечисления.уатСистемаGPS.СКАУТ Тогда
			УчетнаяЗапись = СКАУТ_УчетнаяЗапись;
		ИначеЕсли СистемаGPS = Перечисления.уатСистемаGPS.Wialon Тогда
			УчетнаяЗапись = Wialon_УчетнаяЗапись;
		ИначеЕсли ЗначениеЗаполнено(СистемаGPS) Тогда
			УчетнаяЗапись = ПСМ_УчетнаяЗапись;
		КонецЕсли;
	Конецесли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройки()

	УстановитьПривилегированныйРежим(Истина);
	
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("СистемаGPS",               СистемаGPS);
	СтруктураНастроек.Вставить("УчетнаяЗапись",            УчетнаяЗапись);
	СтруктураНастроек.Вставить("ОтображатьСопоставленные", ОтображатьСопоставленные);
	
	ХранилищеНастроекДанныхФорм.Сохранить(
		"ОбщаяФорма.уатФормаСинхронизацииТСмеждуУАТиМониторингом", 
		"уатФормаСинхронизацииТСмеждуУАТиМониторингом", СтруктураНастроек);
КонецПроцедуры

&НаКлиенте
Процедура СопоставитьТС(ТекТС, ИДвСистемеНавигации)

	ФлагТСДобавлена = Ложь;
	Для Каждого ТекСтрока Из мсвСопоставленныеТС Цикл
		Если ТекСтрока.ТекТС = ТекТС Тогда
			ФлагТСДобавлена = Истина;
			ТекСтрока.ИДвСистемеНавигации = ИДвСистемеНавигации;
			ТекСтрока.СистемаGPS = СистемаGPS;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если Не ФлагТСДобавлена Тогда
		мсвСопоставленныеТС.Добавить(Новый Структура("ТекТС, ИДвСистемеНавигации, СистемаGPS", ТекТС, ИДвСистемеНавигации, СистемаGPS));
	КонецЕСли;
	СопоставитьСервер(мсвСопоставленныеТС);
	
КонецПроцедуры

#КонецОбласти
